apache/nuttx/arch/arm/src/stm32u5/hardware/stm32u5xx_rcc.h
/* Register Addresses *******************************************************/

#define STM32_RCC_CR         (STM32_RCC_BASE + STM32_RCC_CR_OFFSET)
#define STM32_RCC_ICSCR1     (STM32_RCC_BASE + STM32_RCC_ICSCR1_OFFSET)
#define STM32_RCC_ICSCR2     (STM32_RCC_BASE + STM32_RCC_ICSCR2_OFFSET)
#define STM32_RCC_ICSCR3     (STM32_RCC_BASE + STM32_RCC_ICSCR3_OFFSET)
#define STM32_RCC_CRRCR      (STM32_RCC_BASE + STM32_RCC_CRRCR_OFFSET)
#define STM32_RCC_CFGR1      (STM32_RCC_BASE + STM32_RCC_CFGR1_OFFSET)
#define STM32_RCC_CFGR2      (STM32_RCC_BASE + STM32_RCC_CFGR2_OFFSET)
#define STM32_RCC_CFGR3      (STM32_RCC_BASE + STM32_RCC_CFGR3_OFFSET)
#define STM32_RCC_PLL1CFGR   (STM32_RCC_BASE + STM32_RCC_PLL1CFGR_OFFSET)
#define STM32_RCC_PLL2CFGR   (STM32_RCC_BASE + STM32_RCC_PLL2CFGR_OFFSET)
#define STM32_RCC_PLL3CFGR   (STM32_RCC_BASE + STM32_RCC_PLL3CFGR_OFFSET)
#define STM32_RCC_PLL1DIVR   (STM32_RCC_BASE + STM32_RCC_PLL1DIVR_OFFSET)
#define STM32_RCC_PLL1FRACR  (STM32_RCC_BASE + STM32_RCC_PLL1FRACR_OFFSET)
#define STM32_RCC_PLL2DIVR   (STM32_RCC_BASE + STM32_RCC_PLL2DIVR_OFFSET)
#define STM32_RCC_PLL2FRACR  (STM32_RCC_BASE + STM32_RCC_PLL2FRACR_OFFSET)
#define STM32_RCC_PLL3DIVR   (STM32_RCC_BASE + STM32_RCC_PLL3DIVR_OFFSET)
#define STM32_RCC_PLL3FRACR  (STM32_RCC_BASE + STM32_RCC_PLL3FRACR_OFFSET)
#define STM32_RCC_CIER       (STM32_RCC_BASE + STM32_RCC_CIER_OFFSET)
#define STM32_RCC_CIFR       (STM32_RCC_BASE + STM32_RCC_CIFR_OFFSET)
#define STM32_RCC_CICR       (STM32_RCC_BASE + STM32_RCC_CICR_OFFSET)
#define STM32_RCC_AHB1RSTR   (STM32_RCC_BASE + STM32_RCC_AHB1RSTR_OFFSET)
#define STM32_RCC_AHB2RSTR1  (STM32_RCC_BASE + STM32_RCC_AHB2RSTR1_OFFSET)
#define STM32_RCC_AHB2RSTR2  (STM32_RCC_BASE + STM32_RCC_AHB2RSTR2_OFFSET)
#define STM32_RCC_AHB3RSTR   (STM32_RCC_BASE + STM32_RCC_AHB3RSTR_OFFSET)
#define STM32_RCC_APB1RSTR1  (STM32_RCC_BASE + STM32_RCC_APB1RSTR1_OFFSET)
#define STM32_RCC_APB1RSTR2  (STM32_RCC_BASE + STM32_RCC_APB1RSTR2_OFFSET)
#define STM32_RCC_APB2RSTR   (STM32_RCC_BASE + STM32_RCC_APB2RSTR_OFFSET)
#define STM32_RCC_APB3RSTR   (STM32_RCC_BASE + STM32_RCC_APB3RSTR_OFFSET)
#define STM32_RCC_AHB1ENR    (STM32_RCC_BASE + STM32_RCC_AHB1ENR_OFFSET)
#define STM32_RCC_AHB2ENR1   (STM32_RCC_BASE + STM32_RCC_AHB2ENR1_OFFSET)
#define STM32_RCC_AHB2ENR2   (STM32_RCC_BASE + STM32_RCC_AHB2ENR2_OFFSET)
#define STM32_RCC_AHB3ENR    (STM32_RCC_BASE + STM32_RCC_AHB3ENR_OFFSET)
#define STM32_RCC_APB1ENR1   (STM32_RCC_BASE + STM32_RCC_APB1ENR1_OFFSET)
#define STM32_RCC_APB1ENR2   (STM32_RCC_BASE + STM32_RCC_APB1ENR2_OFFSET)
#define STM32_RCC_APB2ENR    (STM32_RCC_BASE + STM32_RCC_APB2ENR_OFFSET)
#define STM32_RCC_APB3ENR    (STM32_RCC_BASE + STM32_RCC_APB3ENR_OFFSET)
#define STM32_RCC_AHB1SMENR  (STM32_RCC_BASE + STM32_RCC_AHB1SMENR_OFFSET)
#define STM32_RCC_AHB2SMENR1 (STM32_RCC_BASE + STM32_RCC_AHB2SMENR1_OFFSET)
#define STM32_RCC_AHB2SMENR2 (STM32_RCC_BASE + STM32_RCC_AHB2SMENR2_OFFSET)
#define STM32_RCC_AHB3SMENR  (STM32_RCC_BASE + STM32_RCC_AHB3SMENR_OFFSET)
#define STM32_RCC_APB1SMENR1 (STM32_RCC_BASE + STM32_RCC_APB1SMENR1_OFFSET)
#define STM32_RCC_APB1SMENR2 (STM32_RCC_BASE + STM32_RCC_APB1SMENR2_OFFSET)
#define STM32_RCC_APB2SMENR  (STM32_RCC_BASE + STM32_RCC_APB2SMENR_OFFSET)
#define STM32_RCC_APB3SMENR  (STM32_RCC_BASE + STM32_RCC_APB3SMENR_OFFSET)
#define STM32_RCC_SRDAMR     (STM32_RCC_BASE + STM32_RCC_SRDAMR_OFFSET)
#define STM32_RCC_CCIPR1     (STM32_RCC_BASE + STM32_RCC_CCIPR1_OFFSET)
#define STM32_RCC_CCIPR2     (STM32_RCC_BASE + STM32_RCC_CCIPR2_OFFSET)
#define STM32_RCC_CCIPR3     (STM32_RCC_BASE + STM32_RCC_CCIPR3_OFFSET)
#define STM32_RCC_BDCR       (STM32_RCC_BASE + STM32_RCC_BDCR_OFFSET)
#define STM32_RCC_CSR        (STM32_RCC_BASE + STM32_RCC_CSR_OFFSET)
#define STM32_RCC_SECCFGR    (STM32_RCC_BASE + STM32_RCC_SECCFGR_OFFSET)
#define STM32_RCC_PRIVCFGR   (STM32_RCC_BASE + STM32_RCC_PRIVCFGR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* RCC clock control register */

#define RCC_CR_MSISON                     (1 << 0)  /* Bit 0: MSIS clock enable */
#define RCC_CR_MSIKERON                   (1 << 1)  /* Bit 1: MSI enable for some peripheral kernels */
#define RCC_CR_MSISRDY                    (1 << 2)  /* Bit 2: MSIS clock ready flag */
#define RCC_CR_MSIPLLEN                   (1 << 3)  /* Bit 3: MSI clock PLL enable */
#define RCC_CR_MSIKON                     (1 << 4)  /* Bit 4: MSIK clock enable */
#define RCC_CR_MSIKRDY                    (1 << 5)  /* Bit 4: MSIK clock ready flag */
#define RCC_CR_MSIPLLSEL                  (1 << 6)  /* Bit 6: MSI clock with PLL mode selection */
#  define RCC_CR_MSIPLLSEL_MSIK           (0)       /* 0: PLL mode applied to MSIK clock output */
#  define RCC_CR_MSIPLLSEL_MSIS           (1 << 6)  /* 1: PLL mode applied to MSIS clock output */
#define RCC_CR_MSIPLLFAST                 (1 << 7)  /* Bit 7: MSI PLL fast start-up */
#define RCC_CR_HSION                      (1 << 8)  /* Bit 8: Internal High Speed clock enable */
#define RCC_CR_HSIKERON                   (1 << 9)  /* Bit 9: HSI16 always enable for peripheral kernels */
#define RCC_CR_HSIRDY                     (1 << 10) /* Bit 10: Internal High Speed clock ready flag */
#define RCC_CR_HSI48ON                    (1 << 12) /* Bit 12: HSI48 clock enable */
#define RCC_CR_HSI48RDY                   (1 << 13) /* Bit 13: HSI48 clock ready flag */
#define RCC_CR_SHSION                     (1 << 14) /* Bit 14: SHSI clock enable */
#define RCC_CR_SHSIRDY                    (1 << 15) /* Bit 15: SHSI clock ready flag */
#define RCC_CR_HSEON                      (1 << 16) /* Bit 16: External High Speed clock enable */
#define RCC_CR_HSERDY                     (1 << 17) /* Bit 17: External High Speed clock ready flag */
#define RCC_CR_HSEBYP                     (1 << 18) /* Bit 18: External High Speed clock Bypass */
#define RCC_CR_CSSON                      (1 << 19) /* Bit 19: Clock Security System enable */
#define RCC_HSEEXT                        (1 << 20) /* Bit 20: HSE external clock bypass mode */
#define RCC_CR_PLL1ON                     (1 << 24) /* Bit 24: PLL1 enable */
#define RCC_CR_PLL1RDY                    (1 << 25) /* Bit 25: PLL1 clock ready flag */
#define RCC_CR_PLL2ON                     (1 << 26) /* Bit 26: PLL2 enable */
#define RCC_CR_PLL2RDY                    (1 << 27) /* Bit 27: PLL2 clock ready flag */
#define RCC_CR_PLL3ON                     (1 << 28) /* Bit 28: PLL3 enable */
#define RCC_CR_PLL3RDY                    (1 << 29) /* Bit 29: PLL3 clock ready flag */

/* RCC internal clock sources calibration register 1 */

