apache/nuttx/arch/arm/src/stm32u5/hardware/stm32u5xx_rcc.h
#define RCC_ICSCR1_MSICAL3_SHIFT          (0) /* Bits 0-4: MSIRC3 clock calibration for MSI ranges 12 to 15 */
#define RCC_ICSCR1_MSICAL3_MASK           (0x1f << RCC_ICSCR1_MSICAL3_SHIFT)
#define RCC_ICSCR1_MSICAL3(n)             ((n) << RCC_ICSCR1_MSICAL3_SHIFT)
#define RCC_ICSCR1_MSICAL2_SHIFT          (5) /* Bits 5-9: MSIRC2 clock calibration for MSI ranges 8 to 11 */
#define RCC_ICSCR1_MSICAL2_MASK           (0x1f << RCC_ICSCR1_MSICAL2_SHIFT)
#define RCC_ICSCR1_MSICAL2(n)             ((n) << RCC_ICSCR1_MSICAL2_SHIFT)
#define RCC_ICSCR1_MSICAL1_SHIFT          (0) /* Bits 10-14: MSIRC1 clock calibration for MSI ranges 4 to 7 */
#define RCC_ICSCR1_MSICAL1_MASK           (0x1f << RCC_ICSCR1_MSICAL1_SHIFT)
#define RCC_ICSCR1_MSICAL1(n)             ((n) << RCC_ICSCR1_MSICAL1_SHIFT)
#define RCC_ICSCR1_MSICAL0_SHIFT          (0) /* Bits 15-19: MSIRC0 clock calibration for MSI ranges 0 to 3 */
#define RCC_ICSCR1_MSICAL0_MASK           (0x1f << RCC_ICSCR1_MSICAL0_SHIFT)
#define RCC_ICSCR1_MSICAL0(n)             ((n) << RCC_ICSCR1_MSICAL0_SHIFT)
#define RCC_ICSCR1_MSIBIAS                (1 << 22) /* Bit 22: MSI bias mode selection */
#define RCC_ICSCR1_MSIRGSEL_MASK          (1 << 23) /* Bit 23: MSI clock range selection */
#define RCC_ICSCR1_MSIRGSEL_CSR           0
#define RCC_ICSCR1_MSIRGSEL_ICSCR1        RCC_ICSCR1_MSIRGSEL_MASK
#define RCC_ICSCR1_MSIKRANGE_SHIFT        (24) /* Bits 24-27: MSIK clock ranges */
#define RCC_ICSCR1_MSIKRANGE_MASK         (0xf << RCC_ICSCR1_MSIKRANGE_SHIFT)
#define RCC_ICSCR1_MSIKRANGE(n)           ((n) << RCC_ICSCR1_MSIKRANGE_SHIFT)
#define RCC_ICSCR1_MSIKRANGE_48MHZ        RCC_ICSCR1_MSIKRANGE(0x0)
#define RCC_ICSCR1_MSIKRANGE_24MHZ        RCC_ICSCR1_MSIKRANGE(0x1)
#define RCC_ICSCR1_MSIKRANGE_16MHZ        RCC_ICSCR1_MSIKRANGE(0x2)
#define RCC_ICSCR1_MSIKRANGE_12MHZ        RCC_ICSCR1_MSIKRANGE(0x3)
#define RCC_ICSCR1_MSIKRANGE_4MHZ         RCC_ICSCR1_MSIKRANGE(0x4)
#define RCC_ICSCR1_MSIKRANGE_2MHZ         RCC_ICSCR1_MSIKRANGE(0x5)
#define RCC_ICSCR1_MSIKRANGE_1330KHZ      RCC_ICSCR1_MSIKRANGE(0x6)
#define RCC_ICSCR1_MSIKRANGE_1MHZ         RCC_ICSCR1_MSIKRANGE(0x7)
#define RCC_ICSCR1_MSIKRANGE_3072KHZ      RCC_ICSCR1_MSIKRANGE(0x8)
#define RCC_ICSCR1_MSIKRANGE_1536KHZ      RCC_ICSCR1_MSIKRANGE(0x9)
#define RCC_ICSCR1_MSIKRANGE_1024KHZ      RCC_ICSCR1_MSIKRANGE(0xa)
#define RCC_ICSCR1_MSIKRANGE_768KHZ       RCC_ICSCR1_MSIKRANGE(0xb)
#define RCC_ICSCR1_MSIKRANGE_400KHZ       RCC_ICSCR1_MSIKRANGE(0xc)
#define RCC_ICSCR1_MSIKRANGE_200KHZ       RCC_ICSCR1_MSIKRANGE(0xd)
#define RCC_ICSCR1_MSIKRANGE_133KHZ       RCC_ICSCR1_MSIKRANGE(0xe)
#define RCC_ICSCR1_MSIKRANGE_100KHZ       RCC_ICSCR1_MSIKRANGE(0xf)
#define RCC_ICSCR1_MSISRANGE_SHIFT        (28) /* Bits 28-31: MSIS clock ranges */
#define RCC_ICSCR1_MSISRANGE_MASK         (0xf << RCC_ICSCR1_MSISRANGE_SHIFT)
#define RCC_ICSCR1_MSISRANGE(n)           ((n) << RCC_ICSCR1_MSISRANGE_SHIFT)
#define RCC_ICSCR1_MSISRANGE_48MHZ        RCC_ICSCR1_MSISRANGE(0x0)
#define RCC_ICSCR1_MSISRANGE_24MHZ        RCC_ICSCR1_MSISRANGE(0x1)
#define RCC_ICSCR1_MSISRANGE_16MHZ        RCC_ICSCR1_MSISRANGE(0x2)
#define RCC_ICSCR1_MSISRANGE_12MHZ        RCC_ICSCR1_MSISRANGE(0x3)
#define RCC_ICSCR1_MSISRANGE_4MHZ         RCC_ICSCR1_MSISRANGE(0x4)
#define RCC_ICSCR1_MSISRANGE_2MHZ         RCC_ICSCR1_MSISRANGE(0x5)
#define RCC_ICSCR1_MSISRANGE_1330KHZ      RCC_ICSCR1_MSISRANGE(0x6)
#define RCC_ICSCR1_MSISRANGE_1MHZ         RCC_ICSCR1_MSISRANGE(0x7)
#define RCC_ICSCR1_MSISRANGE_3072KHZ      RCC_ICSCR1_MSISRANGE(0x8)
#define RCC_ICSCR1_MSISRANGE_1536KHZ      RCC_ICSCR1_MSISRANGE(0x9)
#define RCC_ICSCR1_MSISRANGE_1024KHZ      RCC_ICSCR1_MSISRANGE(0xa)
#define RCC_ICSCR1_MSISRANGE_768KHZ       RCC_ICSCR1_MSISRANGE(0xb)
#define RCC_ICSCR1_MSISRANGE_400KHZ       RCC_ICSCR1_MSISRANGE(0xc)
#define RCC_ICSCR1_MSISRANGE_200KHZ       RCC_ICSCR1_MSISRANGE(0xd)
#define RCC_ICSCR1_MSISRANGE_133KHZ       RCC_ICSCR1_MSISRANGE(0xe)
#define RCC_ICSCR1_MSISRANGE_100KHZ       RCC_ICSCR1_MSISRANGE(0xf)

/* RCC clock configuration register 1 */

#define RCC_CFGR1_SW_SHIFT                (0)       /* Bits 0-1: System clock Switch */
#define RCC_CFGR1_SW_MASK                 (3 << RCC_CFGR1_SW_SHIFT)
#  define RCC_CFGR1_SW_MSIS               (0 << RCC_CFGR1_SW_SHIFT) /* 00: MSIS selected as system clock */
#  define RCC_CFGR1_SW_HSI16              (1 << RCC_CFGR1_SW_SHIFT) /* 00: HSI16 selected as system clock */
#  define RCC_CFGR1_SW_HSE                (2 << RCC_CFGR1_SW_SHIFT) /* 01: HSE selected as system clock */
#  define RCC_CFGR1_SW_PLL                (3 << RCC_CFGR1_SW_SHIFT) /* 10: PLL pll1_r_ck selected as system clock */

#define RCC_CFGR1_SWS_SHIFT               (2)       /* Bits 2-3: System Clock Switch Status */
#define RCC_CFGR1_SWS_MASK                (3 << RCC_CFGR1_SWS_SHIFT)
#  define RCC_CFGR1_SWS_MSIS              (0 << RCC_CFGR1_SWS_SHIFT) /* 00: MSIS oscillator used as system clock */
#  define RCC_CFGR1_SWS_HSI16             (1 << RCC_CFGR1_SWS_SHIFT) /* 00: HSI16 oscillator used as system clock */
#  define RCC_CFGR1_SWS_HSE               (2 << RCC_CFGR1_SWS_SHIFT) /* 01: HSE oscillator used as system clock */
#  define RCC_CFGR1_SWS_PLL               (3 << RCC_CFGR1_SWS_SHIFT) /* 10: PLL used as system clock */

#define RCC_CFGR1_STOPWUCK                (1 << 4) /* Bit 4: Wakeup from Stop and CSS backup clock selection */
#  define RCC_CFGR1_STOPWUCK_MSIS         (0 << 4) /* 0: MSIS */
#  define RCC_CFGR1_STOPWUCK_HSI16        (1 << 4) /* 0: HSI16 */

#define RCC_CFGR_STOPKERWUCK              (1 << 5) /* Bit 5: Wakeup from Stop kernel clock automatic enable selection */
#  define RCC_CFGR1_STOPKERWUCK_MSIK      (0 << 5) /* 0: MSIK */
#  define RCC_CFGR1_STOPKERWUCK_HSI16     (1 << 5) /* 0: HSI16 */

#define RCC_CFGR1_MCOSEL_SHIFT            (24)      /* Bits 24-27: Microcontroller Clock Output */
#define RCC_CFGR1_MCOSEL_MASK             (0x0f << RCC_CFGR1_MCOSEL_SHIFT)
#  define RCC_CFGR1_MCOSEL_NONE           (0 << RCC_CFGR1_MCOSEL_SHIFT) /* 0000: Disabled */
#  define RCC_CFGR1_MCOSEL_SYSCLK         (1 << RCC_CFGR1_MCOSEL_SHIFT) /* 0001: SYSCLK system clock selected */
#  define RCC_CFGR1_MCOSEL_MSIS           (2 << RCC_CFGR1_MCOSEL_SHIFT) /* 0010: MSIS clock selected */
#  define RCC_CFGR1_MCOSEL_HSI16          (3 << RCC_CFGR1_MCOSEL_SHIFT) /* 0011: HSI16 clock selected */
#  define RCC_CFGR1_MCOSEL_HSE            (4 << RCC_CFGR1_MCOSEL_SHIFT) /* 0100: HSE clock selected */
#  define RCC_CFGR1_MCOSEL_PLL            (5 << RCC_CFGR1_MCOSEL_SHIFT) /* 0101: Main PLL clock pll1_r_ck selected  */
#  define RCC_CFGR1_MCOSEL_LSI            (6 << RCC_CFGR1_MCOSEL_SHIFT) /* 0110: LSI clock selected */
#  define RCC_CFGR1_MCOSEL_LSE            (7 << RCC_CFGR1_MCOSEL_SHIFT) /* 0111: LSE clock selected */
#  define RCC_CFGR1_MCOSEL_HSI48          (8 << RCC_CFGR1_MCOSEL_SHIFT) /* 1000: HSI48 clock selected */
#  define RCC_CFGR1_MCOSEL_MSIK           (9 << RCC_CFGR1_MCOSEL_SHIFT) /* 1001: MSIK clock selected */

#define RCC_CFGR1_MCOPRE_SHIFT            (28)      /* Bits 28-30: MCO prescaler */
#define RCC_CFGR1_MCOPRE_MASK             (7 << RCC_CFGR1_MCOPRE_SHIFT)
#  define RCC_CFGR1_MCOPRE_NONE           (0 << RCC_CFGR1_MCOPRE_SHIFT) /* 000: no division */
#  define RCC_CFGR1_MCOPRE_DIV2           (1 << RCC_CFGR1_MCOPRE_SHIFT) /* 001: division by 2 */
#  define RCC_CFGR1_MCOPRE_DIV4           (2 << RCC_CFGR1_MCOPRE_SHIFT) /* 010: division by 4 */
#  define RCC_CFGR1_MCOPRE_DIV8           (3 << RCC_CFGR1_MCOPRE_SHIFT) /* 011: division by 8 */
#  define RCC_CFGR1_MCOPRE_DIV16          (4 << RCC_CFGR1_MCOPRE_SHIFT) /* 100: division by 16 */

/* RCC clock configuration register 2 */

#define RCC_CFGR2_HPRE_SHIFT              (0)       /* Bits 0-3: AHB prescaler */
#define RCC_CFGR2_HPRE_MASK               (0xf << RCC_CFGR2_HPRE_SHIFT)
#  define RCC_CFGR2_HPRE_SYSCLK           ( 0 << RCC_CFGR2_HPRE_SHIFT) /* 0xxx: SYSCLK not divided */
#  define RCC_CFGR2_HPRE_SYSCLK_DIV2      ( 8 << RCC_CFGR2_HPRE_SHIFT) /* 1000: SYSCLK divided by 2 */
#  define RCC_CFGR2_HPRE_SYSCLK_DIV4      ( 9 << RCC_CFGR2_HPRE_SHIFT) /* 1001: SYSCLK divided by 4 */
#  define RCC_CFGR2_HPRE_SYSCLK_DIV8      (10 << RCC_CFGR2_HPRE_SHIFT) /* 1010: SYSCLK divided by 8 */
#  define RCC_CFGR2_HPRE_SYSCLK_DIV16     (11 << RCC_CFGR2_HPRE_SHIFT) /* 1011: SYSCLK divided by 16 */
#  define RCC_CFGR2_HPRE_SYSCLK_DIV64     (12 << RCC_CFGR2_HPRE_SHIFT) /* 1100: SYSCLK divided by 64 */
#  define RCC_CFGR2_HPRE_SYSCLK_DIV128    (13 << RCC_CFGR2_HPRE_SHIFT) /* 1101: SYSCLK divided by 128 */
#  define RCC_CFGR2_HPRE_SYSCLK_DIV256    (14 << RCC_CFGR2_HPRE_SHIFT) /* 1110: SYSCLK divided by 256 */
#  define RCC_CFGR2_HPRE_SYSCLK_DIV512    (15 << RCC_CFGR2_HPRE_SHIFT) /* 1111: SYSCLK divided by 512 */

#define RCC_CFGR2_PPRE1_SHIFT             (4)       /* Bits 4-6: APB1 prescaler */
#define RCC_CFGR2_PPRE1_MASK              (0x7 << RCC_CFGR2_HPRE_SHIFT)
#  define RCC_CFGR2_PPRE1_HCLK            (0 << RCC_CFGR2_HPRE_SHIFT) /* 0xxx: HCLK not divided */
#  define RCC_CFGR2_PPRE1_HCLK_DIV2       (4 << RCC_CFGR2_HPRE_SHIFT) /* 1000: HCLK divided by 2 */
#  define RCC_CFGR2_PPRE1_HCLK_DIV4       (5 << RCC_CFGR2_HPRE_SHIFT) /* 1001: HCLK divided by 4 */
#  define RCC_CFGR2_PPRE1_HCLK_DIV8       (6 << RCC_CFGR2_HPRE_SHIFT) /* 1010: HCLK divided by 8 */
#  define RCC_CFGR2_PPRE1_HCLK_DIV16      (7 << RCC_CFGR2_HPRE_SHIFT) /* 1011: HCLK divided by 16 */

