apache/nuttx/arch/arm/src/stm32u5/hardware/stm32u5xx_rcc.h
#define RCC_CR_HSITRIM_SHIFT             (24)      /* Bits 30-24: Internal High Speed clock trimming */
#define RCC_CR_HSITRIM_MASK              (0x7f << RCC_CR_HSITRIM_SHIFT)
#define RCC_CR_HSICAL_SHIFT              (16)      /* Bits 23-16: Internal High Speed clock Calibration */
#define RCC_CR_HSICAL_MASK               (0xff << RCC_CR_HSICAL_SHIFT)
#define RCC_CR_MSITRIM_SHIFT             (8)       /* Bits 15-8: Internal Multi Speed clock trimming */
#define RCC_CR_MSITRIM_MASK              (0xff << RCC_CR_MSITRIM_SHIFT)
#define RCC_CR_MSICAL_SHIFT              (0)       /* Bits 7-0: Internal Multi Speed clock Calibration */
#define RCC_CR_MSICAL_MASK               (0xff << RCC_CR_MSICAL_SHIFT)

/* RCC clock configuration register 1 */

#define RCC_CFGR1_SW_SHIFT                (0)       /* Bits 0-1: System clock Switch */
#define RCC_CFGR1_SW_MASK                 (3 << RCC_CFGR1_SW_SHIFT)
#  define RCC_CFGR1_SW_MSIS               (0 << RCC_CFGR1_SW_SHIFT) /* 00: MSIS selected as system clock */
#  define RCC_CFGR1_SW_HSI16              (1 << RCC_CFGR1_SW_SHIFT) /* 00: HSI16 selected as system clock */
#  define RCC_CFGR1_SW_HSE                (2 << RCC_CFGR1_SW_SHIFT) /* 01: HSE selected as system clock */
#  define RCC_CFGR1_SW_PLL                (3 << RCC_CFGR1_SW_SHIFT) /* 10: PLL pll1_r_ck selected as system clock */

#define RCC_CFGR1_SWS_SHIFT               (2)       /* Bits 2-3: System Clock Switch Status */
#define RCC_CFGR1_SWS_MASK                (3 << RCC_CFGR1_SWS_SHIFT)
#  define RCC_CFGR1_SWS_MSIS              (0 << RCC_CFGR1_SWS_SHIFT) /* 00: MSIS oscillator used as system clock */
#  define RCC_CFGR1_SWS_HSI16             (1 << RCC_CFGR1_SWS_SHIFT) /* 00: HSI16 oscillator used as system clock */
#  define RCC_CFGR1_SWS_HSE               (2 << RCC_CFGR1_SWS_SHIFT) /* 01: HSE oscillator used as system clock */
#  define RCC_CFGR1_SWS_PLL               (3 << RCC_CFGR1_SWS_SHIFT) /* 10: PLL used as system clock */

#define RCC_CFGR1_STOPWUCK                (1 << 4) /* Bit 4: Wakeup from Stop and CSS backup clock selection */
#  define RCC_CFGR1_STOPWUCK_MSIS         (0 << 4) /* 0: MSIS */
#  define RCC_CFGR1_STOPWUCK_HSI16        (1 << 4) /* 0: HSI16 */

#define RCC_CFGR_STOPKERWUCK              (1 << 5) /* Bit 5: Wakeup from Stop kernel clock automatic enable selection */
#  define RCC_CFGR1_STOPKERWUCK_MSIK      (0 << 5) /* 0: MSIK */
#  define RCC_CFGR1_STOPKERWUCK_HSI16     (1 << 5) /* 0: HSI16 */

#define RCC_CFGR1_MCOSEL_SHIFT            (24)      /* Bits 24-27: Microcontroller Clock Output */
#define RCC_CFGR1_MCOSEL_MASK             (0x0f << RCC_CFGR1_MCOSEL_SHIFT)
#  define RCC_CFGR1_MCOSEL_NONE           (0 << RCC_CFGR1_MCOSEL_SHIFT) /* 0000: Disabled */
#  define RCC_CFGR1_MCOSEL_SYSCLK         (1 << RCC_CFGR1_MCOSEL_SHIFT) /* 0001: SYSCLK system clock selected */
#  define RCC_CFGR1_MCOSEL_MSIS           (2 << RCC_CFGR1_MCOSEL_SHIFT) /* 0010: MSIS clock selected */
#  define RCC_CFGR1_MCOSEL_HSI16          (3 << RCC_CFGR1_MCOSEL_SHIFT) /* 0011: HSI16 clock selected */
#  define RCC_CFGR1_MCOSEL_HSE            (4 << RCC_CFGR1_MCOSEL_SHIFT) /* 0100: HSE clock selected */
#  define RCC_CFGR1_MCOSEL_PLL            (5 << RCC_CFGR1_MCOSEL_SHIFT) /* 0101: Main PLL clock pll1_r_ck selected  */
#  define RCC_CFGR1_MCOSEL_LSI            (6 << RCC_CFGR1_MCOSEL_SHIFT) /* 0110: LSI clock selected */
#  define RCC_CFGR1_MCOSEL_LSE            (7 << RCC_CFGR1_MCOSEL_SHIFT) /* 0111: LSE clock selected */
#  define RCC_CFGR1_MCOSEL_HSI48          (8 << RCC_CFGR1_MCOSEL_SHIFT) /* 1000: HSI48 clock selected */
#  define RCC_CFGR1_MCOSEL_MSIK           (9 << RCC_CFGR1_MCOSEL_SHIFT) /* 1001: MSIK clock selected */

#define RCC_CFGR1_MCOPRE_SHIFT            (28)      /* Bits 28-30: MCO prescaler */
#define RCC_CFGR1_MCOPRE_MASK             (7 << RCC_CFGR1_MCOPRE_SHIFT)
#  define RCC_CFGR1_MCOPRE_NONE           (0 << RCC_CFGR1_MCOPRE_SHIFT) /* 000: no division */
#  define RCC_CFGR1_MCOPRE_DIV2           (1 << RCC_CFGR1_MCOPRE_SHIFT) /* 001: division by 2 */
#  define RCC_CFGR1_MCOPRE_DIV4           (2 << RCC_CFGR1_MCOPRE_SHIFT) /* 010: division by 4 */
#  define RCC_CFGR1_MCOPRE_DIV8           (3 << RCC_CFGR1_MCOPRE_SHIFT) /* 011: division by 8 */
#  define RCC_CFGR1_MCOPRE_DIV16          (4 << RCC_CFGR1_MCOPRE_SHIFT) /* 100: division by 16 */

/* RCC clock configuration register 2 */

#define RCC_CFGR_HPRE_SHIFT              (4)       /* Bits 4-7: AHB prescaler */
#define RCC_CFGR_HPRE_MASK               (0x0f << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLK           ( 0 << RCC_CFGR_HPRE_SHIFT) /* 0xxx: SYSCLK not divided */
#  define RCC_CFGR_HPRE_SYSCLKd2         ( 8 << RCC_CFGR_HPRE_SHIFT) /* 1000: SYSCLK divided by 2 */
#  define RCC_CFGR_HPRE_SYSCLKd4         ( 9 << RCC_CFGR_HPRE_SHIFT) /* 1001: SYSCLK divided by 4 */
#  define RCC_CFGR_HPRE_SYSCLKd8         (10 << RCC_CFGR_HPRE_SHIFT) /* 1010: SYSCLK divided by 8 */
#  define RCC_CFGR_HPRE_SYSCLKd16        (11 << RCC_CFGR_HPRE_SHIFT) /* 1011: SYSCLK divided by 16 */
#  define RCC_CFGR_HPRE_SYSCLKd64        (12 << RCC_CFGR_HPRE_SHIFT) /* 1100: SYSCLK divided by 64 */
#  define RCC_CFGR_HPRE_SYSCLKd128       (13 << RCC_CFGR_HPRE_SHIFT) /* 1101: SYSCLK divided by 128 */
#  define RCC_CFGR_HPRE_SYSCLKd256       (14 << RCC_CFGR_HPRE_SHIFT) /* 1110: SYSCLK divided by 256 */
#  define RCC_CFGR_HPRE_SYSCLKd512       (15 << RCC_CFGR_HPRE_SHIFT) /* 1111: SYSCLK divided by 512 */

#define RCC_CFGR_PPRE1_SHIFT             (8)       /* Bits 8-10: APB Low speed prescaler (APB1) */
#define RCC_CFGR_PPRE1_MASK              (7 << RCC_CFGR_PPRE1_SHIFT)
#  define RCC_CFGR_PPRE1_HCLK            (0 << RCC_CFGR_PPRE1_SHIFT) /* 0xx: HCLK not divided */
#  define RCC_CFGR_PPRE1_HCLKd2          (4 << RCC_CFGR_PPRE1_SHIFT) /* 100: HCLK divided by 2 */
#  define RCC_CFGR_PPRE1_HCLKd4          (5 << RCC_CFGR_PPRE1_SHIFT) /* 101: HCLK divided by 4 */
#  define RCC_CFGR_PPRE1_HCLKd8          (6 << RCC_CFGR_PPRE1_SHIFT) /* 110: HCLK divided by 8 */
#  define RCC_CFGR_PPRE1_HCLKd16         (7 << RCC_CFGR_PPRE1_SHIFT) /* 111: HCLK divided by 16 */

#define RCC_CFGR_PPRE2_SHIFT             (11)      /* Bits 11-13: APB High speed prescaler (APB2) */
#define RCC_CFGR_PPRE2_MASK              (7 << RCC_CFGR_PPRE2_SHIFT)
#  define RCC_CFGR_PPRE2_HCLK            (0 << RCC_CFGR_PPRE2_SHIFT) /* 0xx: HCLK not divided */
#  define RCC_CFGR_PPRE2_HCLKd2          (4 << RCC_CFGR_PPRE2_SHIFT) /* 100: HCLK divided by 2 */
#  define RCC_CFGR_PPRE2_HCLKd4          (5 << RCC_CFGR_PPRE2_SHIFT) /* 101: HCLK divided by 4 */
#  define RCC_CFGR_PPRE2_HCLKd8          (6 << RCC_CFGR_PPRE2_SHIFT) /* 110: HCLK divided by 8 */
#  define RCC_CFGR_PPRE2_HCLKd16         (7 << RCC_CFGR_PPRE2_SHIFT) /* 111: HCLK divided by 16 */

/* PLL configuration register */

#define RCC_PLLCFG_PLLSRC_SHIFT          (0) /* Bit 0-1: Main PLL(PLL) and audio PLLs (PLLSAIx)
                                               * entry clock source */
#define RCC_PLLCFG_PLLSRC_MASK           (3 << RCC_PLLCFG_PLLSRC_SHIFT)
#  define RCC_PLLCFG_PLLSRC_NONE         (0 << RCC_PLLCFG_PLLSRC_SHIFT) /* 000: No clock sent to PLLs */
#  define RCC_PLLCFG_PLLSRC_MSI          (1 << RCC_PLLCFG_PLLSRC_SHIFT) /* 001: MSI selected as PLL source */
#  define RCC_PLLCFG_PLLSRC_HSI16        (2 << RCC_PLLCFG_PLLSRC_SHIFT) /* 010: HSI16 selected as PLL source */
#  define RCC_PLLCFG_PLLSRC_HSE          (3 << RCC_PLLCFG_PLLSRC_SHIFT) /* 011: HSE selected as PLL source */

#define RCC_PLLCFG_PLLM_SHIFT            (4)      /* Bits 4-7: Main PLL (PLL) input clock divider */
#define RCC_PLLCFG_PLLM_MASK             (0x0f << RCC_PLLCFG_PLLM_SHIFT)
#  define RCC_PLLCFG_PLLM(n)             ((n-1) << RCC_PLLCFG_PLLM_SHIFT) /* m = 1..16 */

#define RCC_PLLCFG_PLLN_SHIFT            (8)      /* Bits 8-14: Main PLL (PLL) VCO multiplier */
#define RCC_PLLCFG_PLLN_MASK             (0x7f << RCC_PLLCFG_PLLN_SHIFT)
#  define RCC_PLLCFG_PLLN(n)             ((n) << RCC_PLLCFG_PLLN_SHIFT) /* n = 8..86 */

#define RCC_PLLCFG_PLLPEN                (1 << 16) /* Bit 16: Main PLL PLLSAI3CLK output enable */

#define RCC_PLLCFG_PLLP                  (1 << 17)       /* Bit 17: Main PLL div factor for PLLSAI3CLK */
#  define RCC_PLLCFG_PLLP_7              0               /* 0: PLLP = 7 */
#  define RCC_PLLCFG_PLLP_17             RCC_PLLCFG_PLLP /* 1: PLLP = 17 */

#define RCC_PLLCFG_PLLQEN                (1 << 20) /* Bit 20: Main PLL PLL48M1CLK output enable */

#define RCC_PLLCFG_PLLQ_SHIFT            (21)      /* Bits 21-22: Main PLL division factor for PLL48M1CLK (48 MHz clock) */
#define RCC_PLLCFG_PLLQ_MASK             (3 << RCC_PLLCFG_PLLQ_SHIFT)
#  define RCC_PLLCFG_PLLQ(n)             ((((n)>>1)-1)<< RCC_PLLCFG_PLLQ_SHIFT) /* n=2,4,6,8 */
#  define RCC_PLLCFG_PLLQ_2              (0 << RCC_PLLCFG_PLLQ_SHIFT)           /* 00: PLLQ = 2 */
#  define RCC_PLLCFG_PLLQ_4              (1 << RCC_PLLCFG_PLLQ_SHIFT)           /* 01: PLLQ = 4 */
#  define RCC_PLLCFG_PLLQ_6              (2 << RCC_PLLCFG_PLLQ_SHIFT)           /* 10: PLLQ = 6 */
#  define RCC_PLLCFG_PLLQ_8              (3 << RCC_PLLCFG_PLLQ_SHIFT)           /* 11: PLLQ = 8 */

#define RCC_PLLCFG_PLLREN                (1 << 24) /* Bit 24: Main PLL PLLCLK output enable */

#define RCC_PLLCFG_PLLR_SHIFT            (25)      /* Bits 25-26: Main PLL division factor for PLLCLK (system clock) */
#define RCC_PLLCFG_PLLR_MASK             (3 << RCC_PLLCFG_PLLR_SHIFT)
#  define RCC_PLLCFG_PLLR(n)             ((((n)>>1)-1)<< RCC_PLLCFG_PLLR_SHIFT) /* n=2,4,6,8 */
#  define RCC_PLLCFG_PLLR_2              (0 << RCC_PLLCFG_PLLR_SHIFT)           /* 00: PLLR = 2 */
#  define RCC_PLLCFG_PLLR_4              (1 << RCC_PLLCFG_PLLR_SHIFT)           /* 01: PLLR = 4 */
#  define RCC_PLLCFG_PLLR_6              (2 << RCC_PLLCFG_PLLR_SHIFT)           /* 10: PLLR = 6 */
#  define RCC_PLLCFG_PLLR_8              (3 << RCC_PLLCFG_PLLR_SHIFT)           /* 11: PLLR = 8 */

#define RCC_PLLCFG_PLLPDIV_SHIFT         (27)      /* Bits 31-27: Main PLL division factor for PLLSAI3CLK */
#define RCC_PLLCFG_PLLPDIV_MASK          (0x1f << RCC_PLLCFG_PLLPDIV_SHIFT)
#  define RCC_PLLCFG_PLLPDIV(n)          ((n) << RCC_PLLCFG_PLLDIV_SHIFT) /* n = 2..31 for VCO / 2 .. VCO / 31 */
#  define RCC_PLLCFG_PLLP_CNTRLD         RCC_PLLCFG_PLLPDIV(0)

